# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no
m = int(input('Введите количество долек по длине шоколадки: '))
n = int(input('Введите количество долек по ширине шоколадки: '))
k = int(input('Введите количество долек, которое хотите отломить: '))
if (k % m == 0 or k % n == 0):
    print('yes, у вас получится сделать это одним разломом')
else:
    print ('no, у вас не получится сделать это одним разломом')    